app/controllers/body_shapes_controller.rb

SELECT * FROM "body_shapes"
---
  def index
    @body_shapes = BodyShape.all

SELECT * FROM "body_shapes" WHERE ("body_shapes"."id" = 1)
---
  def show
    @body_shape = BodyShape.find(params[:id])

SELECT * FROM "body_shapes" WHERE ("body_shapes"."id" = 1)
---
  def edit
    @body_shape = BodyShape.find(params[:id])

INSERT INTO "body_shapes" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('flat', '2011-03-29 11:58:04', 2535, '2011-03-29 11:58:04', 'men_body_flat.gif', 'image/gif', '2011-03-29 11:58:04')
---
  def create
    @body_shape = BodyShape.new(params[:body_shape])

    respond_to do |format|
      if @body_shape.save

SELECT * FROM "body_shapes" WHERE ("body_shapes"."id" = 1)
UPDATE "body_shapes" SET "updated_at" = '2011-03-29 12:01:56', "name" = 'Flat' WHERE "id" = 1
---
  def update
    @body_shape = BodyShape.find(params[:id])

    respond_to do |format|
      if @body_shape.update_attributes(params[:body_shape])