app/controllers/chests_controller.rb

SELECT * FROM "chests"
---
  def index
    @chests = Chest.all

SELECT * FROM "chests" WHERE ("chests"."id" = 1)
---
  def show
    @chest = Chest.find(params[:id])

SELECT * FROM "chests" WHERE ("chests"."id" = 1)
---
  def edit
    @chest = Chest.find(params[:id])

INSERT INTO "chests" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('Muscular', '2011-03-29 10:21:24', 2796, '2011-03-29 10:21:24', 'men_chest_muscular.gif', 'image/gif', '2011-03-29 10:21:23')
---
  def create
    @chest = Chest.new(params[:chest])

    respond_to do |format|
      if @chest.save