app/controllers/fabrics_controller.rb

SELECT * FROM "fabrics" LIMIT 20 OFFSET 0
SELECT * FROM "colors"
SELECT * FROM "styles"
---
  def index
    @fabrics = Fabric.paginate(:page => params[:page], :per_page => FABRICS_PER_PAGE)
    @colors = Color.all
    @styles = Style.all