app/controllers/features_controller.rb

  def index
    @features = Feature.paginate(:page => params[:page], :per_page => FEATURES_PER_PAGE)
    @feature_categories = FeatureCategory.all
---
SELECT * FROM "features" LIMIT 20 OFFSET 0
SELECT * FROM "feature_categories"