app/controllers/feature_categories_controller.rb

SELECT * FROM "feature_categories" LIMIT 20 OFFSET 0
---
  def index
    @feature_categories = FeatureCategory.paginate(:page => params[:page], :per_page => FEATURE_CATEGORIES_PER_PAGE)