app/controllers/measurements_controller.rb

SELECT * FROM "measurements"
---
  def index
    @measurements = Measurement.all

SELECT * FROM "measurements" WHERE ("measurements"."id" = 1)
---
  def show
    @measurement = Measurement.find(params[:id])

SELECT * FROM "measurements" WHERE ("measurements"."id" = 2)
---
  def edit
    @measurement = Measurement.find(params[:id])

INSERT INTO "measurements" ("armhole_circum", "created_at", "hip_circum", "shoulder", "chest", "updated_at", "chest_circum", "shirt_length", "body_shape", "waist_circum", "neck_circum", "back_armhole", "shoulder_width", "bicep_circum", "height_inches", "weight_lb", "front_armhole", "sleeve_length", "wrist_circum", "height_feet") VALUES(11.0, '2011-03-29 11:07:33', 11.0, NULL, 'average', '2011-03-29 11:07:33', 11.0, 11.0, 'average', 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0, 11.0)
---
  def create
#    raise params[:measurement].inspect
    @measurement = Measurement.new(params[:measurement])

    respond_to do |format|
      if @measurement.save

SELECT * FROM "measurements" WHERE ("measurements"."id" = 1)
UPDATE "measurements" SET "updated_at" = '2011-03-29 11:38:29', "shoulder" = 'Square', "chest" = 'Average', "body_shape" = 'Average' WHERE "id" = 1
---
  def update
    @measurement = Measurement.find(params[:id])

    respond_to do |format|
      if @measurement.update_attributes(params[:measurement])

SELECT * FROM "measurements" WHERE ("measurements"."id" = 3)
DELETE FROM "measurements" WHERE "id" = 3
---
  def destroy
    @measurement = Measurement.find(params[:id])
    @measurement.destroy