app/controllers/shoulders_controller.rb

SELECT * FROM "shoulders"
---
  def index
    @shoulders = Shoulder.all

SELECT * FROM "shoulders" WHERE ("shoulders"."id" = 1)
---
  def show
    @shoulder = Shoulder.find(params[:id])

SELECT * FROM "shoulders" WHERE ("shoulders"."id" = 1)
---
  def edit
    @shoulder = Shoulder.find(params[:id])

INSERT INTO "shoulders" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at") VALUES('square', '2011-03-29 10:00:23', 2667, '2011-03-29 10:00:23', 'men_shoulders_square.gif', 'image/gif', '2011-03-29 10:00:22')
---
  def create
    @shoulder = Shoulder.new(params[:shoulder])

    respond_to do |format|
      if @shoulder.save

SELECT * FROM "shoulders" WHERE ("shoulders"."id" = 1)
UPDATE "shoulders" SET "updated_at" = '2011-03-29 10:10:07', "name" = 'Square' WHERE "id" = 1
---
  def update
    @shoulder = Shoulder.find(params[:id])

    respond_to do |format|
      if @shoulder.update_attributes(params[:shoulder])