app/controllers/styles_controller.rb

  def index
    @styles = Style.paginate(:page => params[:page], :per_page => STYLES_PER_PAGE)
---
SELECT * FROM "styles" LIMIT 20 OFFSET 0