app/controllers/wizard_controller.rb

SELECT * FROM "colors"
SELECT * FROM "styles"
---
  def choose_fabric
    @colors = Color.all
    @styles = Style.all

SELECT * FROM "feature_categories"
---
  def choose_feature
    @fabric = params['fabric']
    @feature_categories = FeatureCategory.all

SELECT * FROM "fabrics" WHERE (color_id = '2' AND style_id = '1')
---
  def get_fabrics
    @data = Fabric.all(:conditions=>["color_id = ? AND style_id = ?", params['color']["name"], params['style']["name"]])

SELECT * FROM "feature_categories" WHERE ("feature_categories"."id" = 3)
---
  def order
    @values = Hash.new

    params.each do |k,v|
      if k =~ /^feature_category/
        k = k.split("_")[2].capitalize
        name = FeatureCategory.find(k).name